Revit 2027 API
BuiltInFailures.FaceSplitterFailures.EndsNotOnEdgeError Property
 Ends of an open loop in sketch splitting face do not lie on an edge of the face to split.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId EndsNotOnEdgeError { get; }
Public Shared ReadOnly Property EndsNotOnEdgeError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ EndsNotOnEdgeError {
	FailureDefinitionId^ get ();
}
static member EndsNotOnEdgeError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FaceSplitterFailures Class
Autodesk.Revit.DB Namespace